[
    {
        "username": "Faith Baker",
        "stars": 5,
        "comment": "The food is absolutely great but the facility itself is quite filthy and needs deep cleaning."
    },
    {
        "username": "Tammy Odom",
        "stars": 5,
        "comment": "The wait staff was awesome despite the building being very hot and the beans being dry."
    },
    {
        "username": "Wyatt Boswell",
        "stars": 5,
        "comment": "Do not let the exterior fool you because the service is great and food is amazing."
    },
    {
        "username": "Alexus W",
        "stars": 5,
        "comment": "Fantastic chicken fried chicken and they were very cautious with my food allergies which I appreciate."
    },
    {
        "username": "Pam Haston",
        "stars": 5,
        "comment": "Great food and prices with friendly service that left both my husband and me happy today."
    },
    {
        "username": "Andrei Chemeris",
        "stars": 5,
        "comment": "The service here is very pleasant and the food quality is good for the affordable price."
    },
    {
        "username": "Bob Thorman",
        "stars": 5,
        "comment": "Really good chicken fried steak and great service in a very authentic down home Texas setting."
    },
    {
        "username": "Jungle Explorer",
        "stars": 5,
        "comment": "This location has the best chicken fried steak in Texas and the prices are always great."
    },
    {
        "username": "Zane Roberts",
        "stars": 5,
        "comment": "Delicious food that is not overpriced and the waitresses were friendly to our large group daily."
    },
    {
        "username": "Sandy Stone",
        "stars": 5,
        "comment": "The food is good but they really need to take pride and clean up the front."
    },
    {
        "username": "Charlie Watkins",
        "stars": 5,
        "comment": "Small hole in the wall diner with limited seating but the chicken fried steak was awesome."
    },
    {
        "username": "Monica Pagan",
        "stars": 5,
        "comment": "A great mom and pop restaurant where the southern style fish and onion rings were excellent."
    },
    {
        "username": "Karyn Dewitt",
        "stars": 5,
        "comment": "Even with the air conditioner out the food was great and the service was absolutely awesome."
    },
    {
        "username": "Maria Ochoa",
        "stars": 5,
        "comment": "I had an amazing fajita salad and my husband really enjoyed his delicious cheese burger here."
    },
    {
        "username": "Leapfrog",
        "stars": 5,
        "comment": "The Merkel location was very clean with great service and the chicken fried steak was bargain."
    },
    {
        "username": "Jeremy Stoots",
        "stars": 5,
        "comment": "They ran out of ribeyes and the food was bland while the waitress was quite aggressive."
    },
    {
        "username": "Christina Stephen Howard",
        "stars": 5,
        "comment": "The staff was very sweet and the food was amazing with a surprising fried biscuit treat."
    },
    {
        "username": "Stephanie Graf",
        "stars": 5,
        "comment": "The food and setting are fantastic although the waitress was not very attentive to our table."
    },
    {
        "username": "Marie Lewis",
        "stars": 5,
        "comment": "Food and service are always great and this specific Skeet's in Merkel is simply the best."
    },
    {
        "username": "Willie Perry",
        "stars": 5,
        "comment": "All the food tastes the same and sides are small considering the prices they are charging."
    },
    {
        "username": "Sharon Langford",
        "stars": 5,
        "comment": "Great food and service and I highly recommend the Santa Fe burger with homemade onion rings."
    },
    {
        "username": "Dennis Renfro",
        "stars": 5,
        "comment": "The Mexican ribeye was perfect and very tender so I highly recommend trying this specific meal."
    },
    {
        "username": "Double D",
        "stars": 5,
        "comment": "The food is decent but needs more seasoning and the staff can be a bit loud."
    },
    {
        "username": "David Burch",
        "stars": 5,
        "comment": "The El Paso burger is one of the best burgers ever and their chicken fried steak."
    },
    {
        "username": "Amy Hedgecock",
        "stars": 5,
        "comment": "The chicken fried steak was amazing but the puffs are absolutely divine and a must try."
    },
    {
        "username": "James Whitman",
        "stars": 5,
        "comment": "I was surprised by the food quality and the quesadilla was the best I have had."
    },
    {
        "username": "Gena Swearingen",
        "stars": 5,
        "comment": "You have got to get the fries and the combo salad with homemade ranch was great."
    },
    {
        "username": "Scott Mickey",
        "stars": 5,
        "comment": "Excellent food and service with a smile and the hamburger steak was perfectly cooked home food."
    }
]